АТДЛК/src/Documents/ЗаявкаНаПеревозку/ЗаявкаНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПеревозку</name>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ПеречислениеСтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПогрузки</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаРазгрузки</name>
    <type>
      <types>CatalogRef.ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутныйЛист</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
    </type>
  </attributes>
</mdclass:Document>

АТДЛК/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>ЗаявкаКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ЗаявкаНаПеревозку</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяТочка</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяТочка</name>
      <type>
        <types>CatalogRef.ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ПеречислениеСтатусЗаявки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АТДЛК/src/Documents/ЗаявкаНаПеревозку/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Процедура СтатусПриИзмененииНаСервере(СтруктураЗаявкаНаПеревозку)
	Если СтруктураЗаявкаНаПеревозку.МаршрутныйЛист <> Документы.МаршрутныйЛист.ПустаяСсылка() Тогда
		Для Каждого СтрокаТаблицы из СтруктураЗаявкаНаПеревозку.МаршрутныйЛист.Маршрут Цикл
			Если СтрокаТаблицы.ЗаявкаНаПеревозку =  СтруктураЗаявкаНаПеревозку.ЗаявкаНаПеревозку Тогда
//			Документ = СтруктураЗаявкаНаПеревозку.МаршрутныйЛист.ПолучитьОбъект();
//			Документ.Маршрут.Статус = СтруктураЗаявкаНаПеревозку.Статус;
//			Документ.Записать();
			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтруктураЗаявкаНаПеревозку = Новый Структура();
	СтруктураЗаявкаНаПеревозку.Вставить("МаршрутныйЛист", Объект.МаршрутныйЛист);
	СтруктураЗаявкаНаПеревозку.Вставить("Статус", Объект.Статус);
	СтруктураЗаявкаНаПеревозку.Вставить("ЗаявкаНаПеревозку", Объект.Ссылка);
	СтатусПриИзмененииНаСервере(СтруктураЗаявкаНаПеревозку);
КонецПроцедуры
